# Дана послідовність натуральних чисел (одне число в рядку), що завершується двома числами 0 поспіль.
# Визначте, скільки разів в цій послідовності зустрічається число 1. Числа, що йдуть після двох нулів,
# Необхідно ігнорувати. У цьому завданні не можна використовувати глобальні змінні і параметри, що передаються в функцію.
# Функція отримує дані, зчитуючи їх з клавіатури, а не отримуючи їх у вигляді параметрів.
def func():
    Array = []
    i = 0
    n = 0
    while True:
        Array.append(input())
        if Array[i] == '00':
            break
        i += 1
    for i in Array:
        if int(i) == 1:
            n += 1
    return n
print(func())