# Дана послідовність натуральних чисел (одне число в рядку), що завершується числом 0.
# Визначте значення другого за величиною елемента в цій послідовності, тобто елемента, який буде найбільшим,
# якщо з послідовності видалити найбільший елемент. У цьому завданні не можна використовувати глобальні змінні.
# Функція отримує дані, зчитуючи їх з клавіатури, а не отримуючи їх у вигляді параметра.
# У програмі на мові Python функція повертає результат у вигляді кортежу з кількох чисел і функція взагалі не отримує ніяких параметрів.
def max(Array):
    max = Array[0]
    for j in Array:
        if j > max:
            max = j
    return max
def func():
    Array = []
    i = 0
    k = 0
    while True:
        Array.append(int(input()))
        if Array[i] == 0:
            Array.remove(0)
            break
        i += 1
    maxDigit = max(Array)
    for i in Array:
        if i == maxDigit:
            k += 1
    for i in range(k):
        Array.remove(maxDigit)
    return max(Array)
print(func())