# 2. Дано імена чотирьох файлів. Знайти кількість файлів із зазначеними іменами, які є в поточному каталозі.

try:
    f1 = open('files/5_1.txt', 'w')
except:
    print("Error!")

try:
    f2 = open('files/5_2.txt', 'w')
except:
    print("Error!")

try:
    f3 = open('files/5_3.txt', 'w')
except:
    print("Error!")

try:
    f4 = open('files/5_4.txt', 'w')
except:
    print("Error!")
