# Дано цілі числа K і N (N> 0). Вивести N раз число K.
n = int(input("Ввести кол-во раз сколько вывести это число( >0 ): "))
k = int(input("Ввести число: "))
for i in range(0,n):
    print(k)