# Дано додатні числа A і B (A> B). На відрізку довжиною A розміщено максимально можлива кількість відрізків довжиною B (без накладання).
# Не використовуючи операції множення і ділення, знайти довжину незайнятої частини відрізка A.
a = int(input("Введите длину отрезка А: "))
b = int(input("Введите длину отрезка B: "))
while True:
    if a >= b:
        a = a - b
    else:
        print(a)
        break