# Дано ціле число в діапазоні 1-7. Вивести рядок - назва дня тижня, що відповідає даному числу (1 - «понеділок», 2 - «вівторок» і т. д.).
a = int(input("Введите номер дня недели: "))
if a == 1:
    print("Понедельник")
elif a == 2:
    print("Вторник")
elif a == 3:
    print("Среда")
elif a == 4:
    print("Четверг")
elif a == 5:
    print("Пятница")
elif a == 6:
    print("Суббота")
elif a == 7:
    print("Воскресенье")