# Описати рекурсивную функцію Fact2 (N) дійсного типу, яка обчислює значення подвійного факторіала
# N !! = N • (N-2) • (N-4) • ... (N> 0 - параметр цілого типу; останній співмножник в творі дорівнює 2,
# якщо N - парне число, і 1, якщо N - непарне). За допомогою цієї функції обчислити подвійні факторіали п'яти довільних натуральних чисел.

import random as r
def fact2(n):
    if n == 2:
        return 2
    elif n == 1 or n == 0:
        return 1
    else:
        return n * fact2(n - 2)


Array = [r.randint(1,10) for i in range(0, 5)]
for i in Array:
    print(fact2(i))