# Описати рекурсивную функцію RootK (X, K, N) дійсного типу, яка знаходить наближене значення кореня K-го ступеня з числа X за формулою:
# Y0 = 1, YN + 1 = YN - (YN - X / (YN) K-1) / K,
# де YN позначає RootK (X, K, N) при фіксованих X і K. Параметри функції: X (> 0) - дійсне число, K (> 1) і N (> 0) - цілі.
# За допомогою функції RootK знайти для даного числа X наближені значення його кореня K-го ступеня при шести даних значеннях N.

def RootK(x, k, n):
    if n == 0:
        return 1 - (1 - x/1)/k + RootK(x, k, n-1)
    elif n == -1:
        return 1
    else:
        return RootK(x,k,n-1)-(RootK(x,k,n-1)- x / pow(RootK(x,k,n-1),(k-1))) / k

print(RootK(3,2,5))