# Дана сторона квадрата a. Знайти його периметр P=4·a.
a = int(input("Введите сторону квадрата: "))
print("Его периметр = ", 4*a)