# Дана сторона квадрата a. Знайти його площу S=a^2.
a = int(input("Введите сторону квадрата: "))
print("S = ", a*a)